---
kind: method
id: M:Autodesk.Revit.DB.ReferencePlane.GetReference
source: html/825a593b-4acc-c2ad-9df7-b281a3a2575b.htm
---
# Autodesk.Revit.DB.ReferencePlane.GetReference Method

Returns the geometry reference of the reference plane.

## Syntax (C#)
```csharp
public Reference GetReference()
```

## Returns
The geometry reference of the reference plane.